#include<cstdio>

int arr[100010][4];

int main()
{
	int t;
	scanf("%d",&t);
	arr[1][1] = 1;
	arr[2][2] = 1;
	arr[3][1] = 1;
	arr[3][2] = 1;
	arr[3][3] = 1;
	for(int i=4;i<=100000;i++)
	{
		arr[i][1] = (arr[i-1][2]%1000000009 + arr[i-1][3]%1000000009)%1000000009;
		arr[i][2] = (arr[i-2][1]%1000000009 + arr[i-2][3]%1000000009)%1000000009;
		arr[i][3] = (arr[i-3][1]%1000000009 + arr[i-3][2]%1000000009)%1000000009;
	}
	for(int i=0;i<t;i++)
	{
		int n;
		scanf("%d",&n);
		
		printf("%d\n",((arr[n][1]%1000000009 + arr[n][2]%1000000009)%1000000009 + arr[n][3]%1000000009)%1000000009);
	}
}
/*
기본적인 다이나믹
25번행에서의 오버플로우에 주의하자
*/ 
